title: SCHEMA002 lookalike with extra non-spec field
logsource:
    category: process_creation
detection:
    selection:
        Image: x
    condition: selection
custom_extra_field: this is allowed; Sigma permits additional keys
