title: RED002 collision title
id: aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '\collision.exe'
    condition: selection
