title: ATK001 lookalike non-technique tags
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image: '\example.exe'
  condition: selection
tags:
  - attack.execution
  - attack.g0007
