title: ATK004 fail powershell parent only
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
    condition: selection
tags:
  - attack.t1059
