title: Multi-selector rule (no FP001)
logsource:
    category: process_creation
detection:
    selection:
        Image: cmd.exe
    filter:
        CommandLine: legitimate
    condition: selection and not filter
