title: Process creation with no negated filter
logsource:
  category: process_creation
detection:
  selection:
    Image|endswith: \powershell.exe
    CommandLine|contains: suspicious-arg
  condition: selection
